CASE_III/conformalMesh/medium/constant/dynamicMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      dynamicMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dynamicFvMesh   dynamicOversetFvMesh;  // specification of the overset class

solver          multiSolidBodyMotionSolver;

# include "../system/parameters"

multiSolidBodyMotionSolverCoeffs
{
    movingZone1
    {
        solidBodyMotionFunction rotatingMotion;
        
        rotatingMotionCoeffs
        {
            origin      $CofR1;
            axis        (0 0 1);
            omega       $U_rad;
        }
    }
   
    
    movingZone2
    {
        solidBodyMotionFunction rotatingMotion;
        
        rotatingMotionCoeffs
        {
            origin      $CofR2;
            axis        (0 0 1);
            omega       $U_rad_neg;
        }
    }
    
}


// ************************************************************************* //